app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "a"], ["created_at", "2022-04-14 06:32:44.108310"], ["updated_at", "2022-04-14 06:32:44.108310"], ["title", "a"]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ?, "title" = ? WHERE "books"."id" = ?  [["updated_at", "2022-04-16 01:09:54.610245"], ["title", "aa"], ["id", 10]]